nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
/**
 * @file lcl_hadm_measurement.c
 *
 * This file implements platform dependent HADM functionality
 *
 */
/*
 * Copyright 2024 NXP
 * SPDX-License-Identifier: BSD-3-Clause
 */
 
/* === Includes ============================================================ */
#include <stdint.h>
#include <stdbool.h>
#include "fsl_os_abstraction.h"
#include "fsl_ltc.h" /* LTC driver for AES */
#include "EmbeddedTypes.h"
#include "nxp_xcvr_lcl_ctrl.h"
#include "nxp_xcvr_lcl_step_mgr.h"
#include "nxp_xcvr_trim.h"
#include "lcl_hadm_measurement.h"
#include "lcl_xcvr_hal.h"
#include "lcl_hadm_utils.h"
#include "lcl_hadm_hartt.h"
#include "nxp2p4_xcvr.h"
#ifdef SIMULATOR
#include "lcl_xcvr_simu.h"
#endif
#include "board.h"

#if !defined(CPU_KW47B42Z83AFTA_cm33_core1) && !defined(CPU_KW47B42ZB7AFTA_cm33_core1) && !defined(CPU_MCXW727CMFTA_cm33_core1) \
    && !defined(CPU_KW43B43ZC7MFP_NBU) && !defined(CPU_KW43B43ZC7MFT_NBU)
#error this code is supposed to be compiled on KW47/KW43 core1
#endif

/* === Macros ============================================================== */
#define T_SLOT_US           (625U)
#define DCOC_CAL_RETRY_NBR  (2U)

/* The following timings have been measured in debug mode with IAR 9.30.1 */
/* TODO OJE: Exact HAL timings need to be measured on KW47 */
/*! Time needed to execute BLE_HADM_Calibrate()
 * in order to perform the radio calibrations (HPM and DCOC)
 */
#define HADM_HAL_HPM_CAL_US  (180U)
#define HADM_HAL_DCOC_CAL_US (410U)
#define HADM_HAL_RADIO_CAL_US (HADM_HAL_DCOC_CAL_US + HADM_HAL_HPM_CAL_US)

/*! Time needed by the HAL to execute BLE_HADM_EventConfigApply()
 *  Does not need to be exact, should cover longest execution path
 */
#define HADM_HAL_PREPARE_US (50U)

/* In some cases (low power), the SW INT is triggered with up to 9us later than HW trigger */
#define HADM_HAL_RSM_TRIGGER_DELAY_MARGIN (10U)

/* 
 * Time spent in the critical path (impacting radio) to set CS context (PLL, RSM, ...).
 * Does not need to be exact, should cover RSM SW initialization, includes:
 * - time from ISR start to 1st cycle counter capture (10us)
 * - RSM init section (protected by HADM_HAL_RSM_INIT_BUDGET) = between 2 cycle counter captures
 * - Margin to absorb slight ISR drift
 * Characterisation should be done on initiator as a largest value is needed.
 */
/* For BLE/CS transitions */
#define HADM_HAL_RSM_INIT_BUDGET (140U)
 /* Optimized version corresponds to CS/CS transition (no register restore/save for BLE config) */
#define HADM_HAL_RSM_INIT_BUDGET_OPTIM (30U)
/* Additional preparation time for BT=2.0 */
#define HADM_HAL_RSM_INIT_BUDGET_DELTA_BT2 (30U)

/* 2us between cdt_expiry and RSM FSM start */
#define HADM_HAL_RSM_TRIGGER_OFFSET (2U)

/* Contengency time to make sure mode 0 AA is caught */
#define HADM_MODE0_TIMEOUT_MARGIN_US (5U)

/* Enable two sets of capabilities: experimental or regular */
#define HADM_ENABLE_EXPERIMENTAL_CAPABILITIES

/* === Types =============================================================== */

/* === Globals ============================================================= */

#if defined(DEBUG) || (defined(gValidationBuildOptions) && (gValidationBuildOptions == 1))
#define HADM_TRACK_RSM_INIT
#endif

//#define RTT_DEBUG
#ifdef RTT_DEBUG
int32_t rtt_tpm_dbg_buffer[HADM_MAX_NB_STEPS];
int32_t rtt_frac_dbg_buffer[HADM_MAX_NB_STEPS];
int16_t rtt_p_delta_dbg_buffer[HADM_MAX_NB_STEPS];
int32_t rtt_int_adj_dbg_buffer[HADM_MAX_NB_STEPS];
int32_t rtt_common_stat_dbg_buffer[HADM_MAX_NB_STEPS];
uint32_t rtt_nadm_error[HADM_MAX_NB_STEPS];
#endif

static BLE_HADM_HalProperties_t hadm_hal_properties;

static const BLE_HADM_HalCapabilities_t hadm_hal_capabilities = {
    .stepModeSupported          = 1U, /* step mode 3 is supported */
    .numAntennasSupported       = HADM_MAX_NB_ANTENNAS,
    .nNumAPSupported            = HADM_MAX_NB_ANTENNA_PATHS,
    .RTT_Capability             = 0x2DU, /* AA only and random sequence for 1Mbps and 2Mbps */
    .RTT_Coarse_N               = 10U, /* Number of RTT steps to satisfy the precision requirement. */ 
    .RTT_Sounding_N             = 0U, /* not supported */
    .RTT_Random_Sequence_N      = 10U, /* Number of RTT steps to satisfy the precision requirement. */
    .RTT_2M_Coarse_N            = 7U, /* Number of RTT steps to satisfy the precision requirement. */
    .RTT_2M_Sounding_N          = 0U, /* not supported */
    .RTT_2M_Random_Sequence_N   = 7U, /* Number of RTT steps to satisfy the precision requirement. */
    .NADM_Sounding_Capability   = 0U, /* NADM not supported */
    .NADM_Random_Sequence_Capability = 1U, /* NADM supported */
    .PHYSupported               = 1U<<1U | 1U<<2U , /* 2Mbps PHY supported (bit #1) & 2Mbps 2BT PHY supported (bit #2) */
    .T_SW_TimeSupported         = 2U,
    .FAErequired                = 0U, /* no FAE */
    .InlinePhaseReturn          = 0U, /* not supported */
    /* note: mandatory timings are not included in capabilities */
    .T_IP1_TimesSupported       = 0x007CU, /* T_IP1=80,60,50,40,30 us */
    .T_IP2_TimesSupported       = 0x007CU, /* T_IP2=80,60,50,40,30 us */
    .T_FCS_TimesSupported       = 0x01F8, /* T_FCS=120,100,80,60,50,40 us */
    .T_PM_TimesSupported        = 0x0003U, /* T_PM=20us or 10us */
    .TX_SNR                     = 0x0FU, /* 18dB, 21 dB, 24 dB and 27dB supported */
    .T_IP2_IPT_TimesSupported   = 0x0000U,  /* not supported */
    .T_SW_IPT_TimeSupported     = 0U, /* not supported */
};

/* Enable when experimental features differ from non-experimental */
#ifdef HADM_ENABLE_EXPERIMENTAL_CAPABILITIES
static const BLE_HADM_HalCapabilities_t hadm_hal_capabilities_experimental = {
    .stepModeSupported          = 1U, /* step mode 3 is supported */
    .numAntennasSupported       = HADM_MAX_NB_ANTENNAS,
    .nNumAPSupported            = HADM_MAX_NB_ANTENNA_PATHS,
    .RTT_Capability             = 0x2DU, /* AA only and random sequence for 1Mbps and 2Mbps */
    .RTT_Coarse_N               = 10U, /* Number of RTT steps to satisfy the precision requirement. */ 
    .RTT_Sounding_N             = 0U, /* not supported */
    .RTT_Random_Sequence_N      = 10U, /* Number of RTT steps to satisfy the precision requirement. */
    .RTT_2M_Coarse_N            = 7U, /* Number of RTT steps to satisfy the precision requirement. */
    .RTT_2M_Sounding_N          = 0U, /* not supported */
    .RTT_2M_Random_Sequence_N   = 7U, /* Number of RTT steps to satisfy the precision requirement. */
    .NADM_Sounding_Capability   = 0U, /* NADM not supported */
    .NADM_Random_Sequence_Capability = 1U, /* NADM supported */
    .PHYSupported               = 1U<<1U | 1U<<2U , /* 2Mbps PHY supported (bit #1) & 2Mbps 2BT PHY supported (bit #2) */
    .T_SW_TimeSupported         = 2U,
    .FAErequired                = 0U, /* no FAE */
    .InlinePhaseReturn          = 1U,
    /* note: mandatory timings are not included in capabilities */
    .T_IP1_TimesSupported       = 0x007CU, /* T_IP1=80,60,50,40,30 us */
    .T_IP2_TimesSupported       = 0x007CU, /* T_IP2=80,60,50,40,30 us */
    .T_FCS_TimesSupported       = 0x01F8, /* T_FCS=120,100,80,60,50,40 us */
    .T_PM_TimesSupported        = 0x0003U, /* T_PM=20us or 10us */
    .TX_SNR                     = 0x0FU, /* 18dB, 21 dB, 24 dB and 27dB supported */
    .T_IP2_IPT_TimesSupported   = 0x007CU, /* T_IP2_IPT=same as T_IP2 */
    .T_SW_IPT_TimeSupported     = 4U, /* 4us (TBC)*/
};
#endif

