nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    /* Initialize temperature compensation (assume 25 degrees C in case the host does not inform NBU) */
    lcl_hadm_handle_temperature_change(HADM_TEMPERATURE_CENTER);

    /* Initialize default value for phase rotation offset */
    lcl_hadm_init_phase_offset();

    /* Init LTC for DRBG */
    LTC_Init(LTC0);

    /* Backup TSM */
    lcl_hal_xcvr_hadm_backup();
    
    assert(hadm_device.is_rsm_cal_done == true);
    return hal_status;
}

/* This API is supposed to be called in the context of idle task */
void lcl_hadm_handle_temperature_change(int32_t temperature)
{
    OSA_DisableIRQGlobal();
    hadm_device.current_temperature = (int16_t)temperature;
    lcl_hadm_utils_calc_rtt_temperature_delay(temperature, &hadm_device);
    OSA_EnableIRQGlobal();
}

BLE_HADM_STATUS_t lcl_hadm_set_antenna_type(uint8 *antBoardTable)
{
    BLE_HADM_STATUS_t hal_status = HADM_HAL_SUCCESS;
    
    for (uint8_t i = 0; i < HADM_MAX_NB_ANTENNAS; i++)
    {
        if (antBoardTable[i] <= 15U) /* max is 4 bits */
        {
            hadm_device.ant2gpio[i] = antBoardTable[i];
        }
        else
        {
           hal_status = HADM_HAL_INVALID_ARGS;
           assert(0);
           break;
        }
    }
    
    if (hal_status == HADM_HAL_SUCCESS)
    {
        LCL_HAL_SET_ANTENNA_PORT(hadm_device.ant2gpio[0]);
    }
    
    return hal_status;
}

BLE_HADM_STATUS_t lcl_hadm_set_fem_config(uint8 *fem_config_ptr, uint8_t config_len)
{
    /* check for consistency of parameter number w.r.t XCVR */
    if ((fem_config_ptr != NULL) && (config_len == sizeof(xcvr_pa_fem_config_t)))
    {
        pa_fem_config.op_mode                  = (XCVR_ANTX_MODE_T)fem_config_ptr[0];
        pa_fem_config.ant_sel_pins_enable      = fem_config_ptr[1];
        pa_fem_config.tx_rx_switch_pins_enable = fem_config_ptr[2];
        pa_fem_config.high_z_enable            = fem_config_ptr[3];
        pa_fem_config.use_fad_state_machine    = fem_config_ptr[4];
        pa_fem_config.ant_a_pad_control        = (XCVR_FAD_NOT_GPIO_MODE_T)fem_config_ptr[5];
        pa_fem_config.ant_b_pad_control        = (XCVR_FAD_NOT_GPIO_MODE_T)fem_config_ptr[6];
        pa_fem_config.tx_switch_pad_control    = (XCVR_FAD_NOT_GPIO_MODE_T)fem_config_ptr[7];
        pa_fem_config.rx_switch_pad_control    = (XCVR_FAD_NOT_GPIO_MODE_T)fem_config_ptr[8];
        pa_fem_config.pa_tx_wu                 = fem_config_ptr[9];
        pa_fem_config.pa_tx_wd                 = fem_config_ptr[10];
        pa_fem_config.lna_rx_wu                = fem_config_ptr[11];
        pa_fem_config.lna_rx_wd                = fem_config_ptr[12];
        pa_fem_config.tx_switch_pol_control    = (XCVR_RX_TX_POLARITY_MODE_T)fem_config_ptr[13];
        pa_fem_config.rx_switch_pol_control    = (XCVR_RX_TX_POLARITY_MODE_T)fem_config_ptr[14];

        fem_active = 1U;
        return HADM_HAL_SUCCESS;
    }
    else
    {
        return HADM_HAL_INVALID_ARGS;
    }
}

void lcl_hadm_set_dma_debug_buffer(uint16 dma_debug_buff_size, uint32 dma_debug_buff_address)
{
    hadm_device.dma_debug_buff_size = dma_debug_buff_size;
    hadm_device.dma_debug_buff_address = dma_debug_buff_address;
}

BLE_HADM_STATUS_t lcl_hadm_calibrate_dcoc(BLE_HADM_rttPhyMode_t rtt_phy)
{   
    xcvrLclStatus_t status;
    XCVR_RSM_SQTE_RATE_T xcvr_rate = LCL_HAL_PHY_TO_XCVR_RATE(rtt_phy);
    
    DEBUG_PIN0_SET

    /* trigger calibration */
    XCVR_LCL_CalibrateDcocStart(xcvr_rate);
    /* wait for results */
    status = XCVR_LCL_CalibrateDcocCompleteFine(&hadm_device.dcoc_cal_results[rtt_phy]);

    DEBUG_PIN0_CLR

    return (status == gXcvrLclStatusSuccess ? HADM_HAL_SUCCESS : HADM_HAL_FAIL);
}

BLE_HADM_STATUS_t lcl_hadm_calibrate_pll(BLE_HADM_rttPhyMode_t rtt_phy)
{   
    xcvrLclStatus_t status = gXcvrLclStatusSuccess;
    XCVR_RSM_SQTE_RATE_T xcvr_rate = LCL_HAL_PHY_TO_XCVR_RATE(rtt_phy);
    BLE_HADM_STATUS_t hal_status = HADM_HAL_SUCCESS;

    DEBUG_PIN0_SET

    /* Backup PLL config */
    lcl_hal_xcvr_pll_settings_backup();

#ifdef HADM_PLL_CAL_INTERPOLATION
    uint16_t chan40_ovrd;
    /* Trigger manual calibration on channel 40 */
    (void)XCVR_LCL_MakeChanNumFromHadmIndex(40 /* 2442 MHz */, &chan40_ovrd);
    DEBUG_PIN1_SET
    status = XCVR_LCL_CalibratePll((const channel_num_t *)&chan40_ovrd, (xcvr_lcl_pll_cal_data_t *)(void*)&hadm_device.cal_ch40[rtt_phy], 1U, false, xcvr_rate);
    DEBUG_PIN1_CLR
#else

    /* Trigger manual calibration on all channels */
    uint16_t chan;
    uint16_t fstep_chan_num_ovrd[HADM_MAX_CHANNELS] = {0U};
    for (chan=0; chan < HADM_MAX_CHANNELS; chan++)
    {
        status += XCVR_LCL_MakeChanNumFromHadmIndex(chan, &fstep_chan_num_ovrd[chan]);
    }
    DEBUG_PIN1_SET
    status += XCVR_LCL_CalibratePll(fstep_chan_num_ovrd, (xcvr_lcl_pll_cal_data_t *)&hadm_device.cal_data[rtt_phy], HADM_MAX_CHANNELS, false, xcvr_rate);
    DEBUG_PIN1_CLR
#endif
    
    /* Restore PLL config */
    lcl_hal_xcvr_pll_settings_restore();

    if (gXcvrLclStatusSuccess == status)
    {
        /* Mark calibration as available */
        hal_status = HADM_HAL_SUCCESS;
    }
    else
    {
        hal_status = HADM_HAL_FAIL;
    }

    DEBUG_PIN0_CLR

    return hal_status;
}

const BLE_HADM_HalProperties_t *lcl_hadm_get_properties(void)
{
    return &hadm_hal_properties;
}

/* Because the time needed to program CS in the XCVR (RSM, TSM etc ...) is significant, we have to 
 * estimate its duration as precisely as possible in order to adjust the time lost between scheduler trigger
 * and actual over the air activity. Adjustement can be determined from the configuration.
 * Main contributors identified today:
 * - BT2.0 programming
 * - whether or not a BLE/CS transition will occur
 */
static uint16_t lcl_hadm_compute_rsm_trigger_delay(const BLE_HADM_SubeventConfig_t *hadm_config_p)
{
    uint16_t rsm_trigger_delay;

    if ((HADM_IS_RSM_OPTIM_INACTIVE(hadm_config_p)) ||
        (hadm_config_p->subeventIdx == 0U))
    {
        rsm_trigger_delay = HADM_HAL_RSM_INIT_BUDGET + HADM_HAL_RSM_TRIGGER_DELAY_MARGIN;
    }
    else
    {
        rsm_trigger_delay = HADM_HAL_RSM_INIT_BUDGET_OPTIM + HADM_HAL_RSM_TRIGGER_DELAY_MARGIN;
    }
    if (hadm_config_p->rttPhy == HADM_RTT_PHY_2MBPS_2BT)
    {
        rsm_trigger_delay += HADM_HAL_RSM_INIT_BUDGET_DELTA_BT2;
    }

    return rsm_trigger_delay;
}

