nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
void lcl_hadm_get_preparation_timings(const BLE_HADM_SubeventConfig_t *hadm_config_p,
                                      uint16_t *prepare_time,
                                      uint16_t *warmup_time,
                                      uint16_t *warmdown_time)
{
    uint16_t rsm_trigger_delay = lcl_hadm_compute_rsm_trigger_delay(hadm_config_p);

    /* prepare_time */
    *prepare_time = HADM_HAL_PREPARE_US;

    /* warmup_time */
    if (hadm_config_p->role == HADM_ROLE_INITIATOR)
    {
        *warmup_time = hadm_hal_properties.txWarmupUs;
    }
    else
    {
        *warmup_time = hadm_hal_properties.rxWarmupUs;
    }
    *warmup_time += rsm_trigger_delay;

    /* warmdown_time */
    *warmdown_time = 0;
}

const BLE_HADM_HalCapabilities_t *lcl_hadm_get_capabilities(uint8 isExperimental)
{
#ifdef HADM_ENABLE_EXPERIMENTAL_CAPABILITIES
    if (isExperimental != 0U)
    {
        return &hadm_hal_capabilities_experimental;
    }
    else
#endif
    {
        return &hadm_hal_capabilities;
    }
}

BLE_HADM_STATUS_t lcl_hadm_check_config(const BLE_HADM_SubeventConfig_t *hadm_config)
{   
    if((hadm_config->stepsNb > HADM_MAX_NB_STEPS) || (hadm_config->stepsNb < HADM_MIN_NB_STEPS))
    {   goto config_error; }

    if (hadm_config->chModePmAntMap[0].mode != 0U) /* First step shall be mode 0 */
    {   goto config_error; }
    
    if (hadm_config->T_PM_Time > HADM_T_PM_40)
    {   goto config_error; }
    
    if ((hadm_config->toneAntennaConfigIdx == HADM_ANT_CFG_IDX_0) && (hadm_config->T_SW_Time != HADM_T_SW_0)) /* N_AP=1 => T_SW=0 */
    {   goto config_error; }
        
    if ((hadm_config->toneAntennaConfigIdx != HADM_ANT_CFG_IDX_0) && (hadm_config->T_SW_Time < HADM_T_SW_2)) /* only T_SW >1us is supported */
    {   goto config_error; }

    if ((hadm_config->rttAntennaID == 0U) || ((hadm_config->rttAntennaID > HADM_MAX_NB_ANTENNAS) && (hadm_config->rttAntennaID < HADM_RTT_ANT_ROUND_ROBIN)))
    {   goto config_error; }

    if (hadm_config->subeventIdx >= HADM_NUM_SUBEVENTS_MAX)
    {   goto config_error; }
    
    if (hadm_config->connIdx >= HADM_MAX_NB_CONNECTIONS)
    {   goto config_error; }

    return HADM_HAL_SUCCESS;
    
config_error:
    return HADM_HAL_INVALID_ARGS;
}

/* Make sure the execution of this function is not disruptive on any HW module (RSM, TSM, LCL, etc.) as it might be called while */
/* another measuremnt instance is running */
BLE_HADM_STATUS_t lcl_hadm_configure(const BLE_HADM_SubeventConfig_t *hadm_config)
{
    uint32_t i;
    xcvrLclStatus_t status;
    hadm_meas_t *hadm_meas_p = lcl_hadm_alloc_meas_instance();
    assert(NULL != hadm_meas_p);
    xcvr_lcl_rsm_config_t *rsm_config_p = &hadm_meas_p->rsm_config;
    uint16_t mode0_timeout_usec;

    DEBUG_PIN0_SET

    if (!hadm_device.is_rsm_cal_done)
    {
        goto config_error; /* at this point all calibration must have ben performed */
    }

#ifdef HADM_TRACK_RSM_INIT
    hadm_device.sys_clock_freq = (uint16_t)(BOARD_GetSystemCoreClockFreq()/1000000U);
#endif /* HADM_TRACK_RSM_INIT */

    hadm_meas_p->config_p = hadm_config; /* save config ptr */
    
    hadm_meas_p->mode0_complete = false;
    hadm_meas_p->debug_flags = hadm_config->debugFlags;
    
    /* Configure iq_avg_win according to T_PM: choose the closest smaller power of 2 to generate 4 IQ avg windows whatever
     * the configuration.
     * iq_avg_win is the number of samples (power of 2) per averaging window, based on
     *  4 samples per us when XCVR clocked for 1 Mbps
     *  8 samples per us when XCVR clocked for 2 Mbps
     * For instance with T_PM=20us: (4us)*4=16us with 4us of transition (discarded at start/end of T_PM)
     * - at 1 Mbps: 16 samples per avg window (4us)
     * - at 2 Mbps: 32 samples per avg window (4us)
     */

    switch (hadm_config->T_PM_Time)
    {
        case HADM_T_PM_40:
          hadm_meas_p->iq_avg_win = 5U;
          break;
        case HADM_T_PM_20:
          hadm_meas_p->iq_avg_win = 4U;
          break;
        case HADM_T_PM_10:
          hadm_meas_p->iq_avg_win = 3U;
          break;
        default:
          hadm_meas_p->iq_avg_win = 0xFFU; /* invalid value allows error handling */
          break;
    }
    if (hadm_meas_p->iq_avg_win == 0xFFU) { goto config_error; }

    /* Capture window size in us, this will always result in 4 averaged values / AP / step */
    hadm_meas_p->iq_capture_win = (uint8_t)(1U << hadm_meas_p->iq_avg_win);
#ifndef RSM_DBG_IQ
    if ((hadm_meas_p->debug_flags & HADM_DBG_FLG_AVG_OFF) != 0U)
#endif
    {
        hadm_meas_p->iq_avg_win = 0U;
    }
#ifndef RSM_DBG_IQ
    else if (hadm_config->rttPhy != HADM_RTT_PHY_1MBPS)
    {
        /* Double IQ averaging window in order to get the same number of final (averaged) samples whatever the data rate */
        hadm_meas_p->iq_avg_win ++;
    }
    else
    { /* MISRA */ }
#endif
    HADM_COMPUTE_NUM_ANTENNA(hadm_config->role, (uint8_t)hadm_config->toneAntennaConfigIdx, hadm_meas_p->num_ant, hadm_meas_p->n_ap);
    
    /* Compute IQ buffer size */
    if ((hadm_meas_p->debug_flags & HADM_DBG_FLG_IQ_DMA) != 0U)
    {
      lcl_hadm_utils_compute_iq_buff_size(hadm_config, hadm_meas_p, (hadm_config->rttPhy == HADM_RTT_PHY_1MBPS) ? RX_SAMPLING_RATE:(RX_SAMPLING_RATE*SAMPLING_RATE_FACTOR_2MBPS));
    }
    /* Compute step mode durations */
    lcl_hadm_utils_compute_step_duration(hadm_config, hadm_meas_p->n_ap, hadm_meas_p->step_duration);

    /* RTT: Compute RTT local contributions */
    lcl_hadm_utils_calc_ts_delay(hadm_meas_p, &hadm_device);

    /* Configure rttAntennaID to be used during first mode 0 */
    /* If no recommendation from the host then apply crossed roud robin in the controller since it gives better perf */
    if (hadm_config->rttAntennaID >= HADM_RTT_ANT_ROUND_ROBIN)
    {   hadm_meas_p->rtt_antenna_id = 0U;  }   /* start round robin */
    else
    {   hadm_meas_p->rtt_antenna_id = hadm_config->rttAntennaID - 1U;  }   /* fixed antenna */
    
    /* Clear info structs */
    hadm_meas_p->info.rtt_dbg_buffer_nb = 0;
    hadm_meas_p->info.mciq_dbg_buffer_nb = 0;
    hadm_meas_p->info.sync_cfo = 0;
    hadm_meas_p->info.sync_rxgain = 0xFF;
    hadm_meas_p->info.sync_rssi = -128;
    hadm_meas_p->info.sync_step_id = 0xFF;
    hadm_meas_p->info.flags = 0;
    hadm_meas_p->info.xtal_trim = 0U; /* = (int32_t)XCVR_GetXtalTrim() avoid use XCVR_GetXtalTrim which use RFMC and requires CM33 wakeup */
    hadm_meas_p->info.temperature = (int8_t)hadm_device.current_temperature;
    hadm_meas_p->info.num_time_adj = 0;
    
    hadm_meas_p->pkt_ram.config_write_ptr = hadm_meas_p->pkt_ram.step_config.base_ptr;
    hadm_meas_p->pkt_ram.result_read_ptr = hadm_meas_p->pkt_ram.step_result.base_ptr;
    hadm_meas_p->pkt_ram.step_config.curr_page = 0;
    hadm_meas_p->pkt_ram.step_config.curr_step_idx = 0;
    hadm_meas_p->pkt_ram.step_config.max_step_size = LCL_HAL_PKT_RAM_STEP_CONFIG_MODE13_SIZE(hadm_meas_p->n_ap) + rtt_type_2_payload_size[hadm_meas_p->config_p->rttTypes] * 2U; /* taking mode1/3 into account */
    hadm_meas_p->pkt_ram.step_result.curr_page = 0;
    hadm_meas_p->pkt_ram.step_result.curr_step_idx = 0;
    hadm_meas_p->pkt_ram.step_result.max_step_size = LCL_HAL_PKT_RAM_STEP_RESULT_MODE3_SIZE(hadm_meas_p->n_ap); /* taking mode3 into account */
    if (hadm_meas_p->config_p->role == HADM_ROLE_SNIFFER)
    {
        hadm_meas_p->pkt_ram.step_result.max_step_size *= HADM_SNIFFER_DEVICE_NB;
    }
    /* Compute nb_steps_before_irq based on larget circ buffer step size (+ contingency (/2)) */
    hadm_meas_p->pkt_ram.nb_steps_before_irq = (uint8_t)((HADM_HAL_PKT_RAM_CONFIG_CIRC_BUFF_SIZE / (MAX(hadm_meas_p->pkt_ram.step_config.max_step_size, hadm_meas_p->pkt_ram.step_result.max_step_size))) / 2U);
    if (hadm_meas_p->pkt_ram.nb_steps_before_irq > HADM_HAL_PKT_RAM_MAX_NB_STEPS_BEFORE_IRQ)
    {
        hadm_meas_p->pkt_ram.nb_steps_before_irq = HADM_HAL_PKT_RAM_MAX_NB_STEPS_BEFORE_IRQ;
    }
    hadm_meas_p->pkt_ram.nb_irq_steps_handled = 0;
    hadm_meas_p->pkt_ram.nb_irq_steps_postponed = 0;
    for (i=0; i < HADM_MAX_NB_STEPS_MODE0; i++)
    {
        hadm_meas_p->sync_info[i].valid = 0U;
    }
    hadm_meas_p->data_in_flight_w_idx = 0;
    hadm_meas_p->data_in_flight_r_idx = 0;
    hadm_meas_p->rsm_trigger_delay = lcl_hadm_compute_rsm_trigger_delay(hadm_meas_p->config_p);

    /* Prepare RSM configuration in RAM */
    DEBUG_PIN1_SET 
    
    rsm_config_p->num_steps = hadm_meas_p->config_p->stepsNb;
    rsm_config_p->num_ant_path = hadm_meas_p->n_ap;
    rsm_config_p->phy = (XCVR_RSM_PHY_T)hadm_meas_p->config_p->rttPhy;
    rsm_config_p->rsm_dma_dly_fm_ext = (HADM_T_FM - hadm_meas_p->iq_capture_win) >> 1; /* center capture window inside T_FM */
    rsm_config_p->rsm_dma_dur_fm_ext = hadm_meas_p->iq_capture_win;
    rsm_config_p->averaging_win = (hadm_meas_p->iq_avg_win == 0U) ? XCVR_RSM_AVG_WIN_DISABLED : (XCVR_RSM_AVG_WIN_LEN_T)(hadm_meas_p->iq_avg_win - 1U);
    /* RSM trig_delay must cover start API execution time */
    rsm_config_p->trig_delay = hadm_meas_p->rsm_trigger_delay;
    rsm_config_p->t_fc = (uint8_t)hadm_config->T_FCS_Time;
    rsm_config_p->t_ip1 = (uint8_t)hadm_config->T_IP1_Time;
    rsm_config_p->t_ip2 = (uint8_t)hadm_config->T_IP2_Time;
    rsm_config_p->t_sw = (lclTSw_t)hadm_config->T_SW_Time;
    rsm_config_p->rtt_type = (XCVR_RSM_RTT_TYPE_T)hadm_meas_p->config_p->rttTypes;
    rsm_config_p->role = (hadm_config->role == HADM_ROLE_INITIATOR) ? XCVR_RSM_TX_MODE : XCVR_RSM_RX_MODE;
    rsm_config_p->sniffer_mode_en = (hadm_config->role == HADM_ROLE_SNIFFER);
    rsm_config_p->enable_inpr = (bool)hadm_config->inlinePhaseReturn;
    rsm_config_p->hpm_cal_manual_val = hadm_device.cal_ch40[hadm_meas_p->config_p->rttPhy].hpm_cal_val;
    rsm_config_p->use_rccal_manual_override = hadm_device.rccal_manual_override_needed;
    rsm_config_p->manual_rccal_value = hadm_device.rtt_static_comp.rttRCcal;
    rsm_config_p->pa_ramp_time = hadm_device.paRampingTime;

