nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    if (hadm_meas_p->config_p->mode != HADM_SUBEVT_TEST_MODE_PHASE_STAB)
    {
        rsm_config_p->op_mode = XCVR_RSM_SQTE_MODE;
        rsm_config_p->t_pm0 = (uint16_t)(((uint32_t)hadm_meas_p->n_ap + 1U) * ((uint32_t)hadm_meas_p->config_p->T_PM_Time + (uint32_t)hadm_meas_p->config_p->T_SW_Time));
    }
    else
    {
        rsm_config_p->op_mode = XCVR_RSM_SQTE_STABLE_PHASE_TEST_MODE;
        rsm_config_p->t_pm0 = LCL_HAL_T_PM_MEAS; /* Set to T_PM_MEAS for stable phase test */
        hadm_meas_p->iq_buff_size_mode0 = 0;
        hadm_meas_p->iq_buff_size = 0;
        hadm_meas_p->iq_avg_win = 0;
    }
    
    /* Determine and program rx timeout (for reflector devices) = mode 0 duration in order to keep RX channel in sync with initiator */
    /* From HW spec: RSM timeout interval = mode0_timeout + T_FCS + T_RD + TX_DATA_FLUSH_DLY + 1 */
    mode0_timeout_usec = (uint16_t)((uint32_t)hadm_meas_p->step_duration[0] - ((uint32_t)hadm_config->T_FCS_Time + T_RD + ((hadm_config->rttPhy == HADM_RTT_PHY_1MBPS) ? TX_DATA_FLUSH_DLY_1MBPS:TX_DATA_FLUSH_DLY_2MBPS) + 1U));
    assert(mode0_timeout_usec > HADM_T_SY(hadm_config->rttPhy) + HADM_MODE0_TIMEOUT_MARGIN_US);
    /* If window widening is larger than the mode0 RX window minus packet duration, do not activate rx timeout */
    if ((hadm_meas_p->config_p->mode == HADM_SUBEVT_MISSION_MODE) &&
        (hadm_config->rxWindowUs < ((uint32_t)mode0_timeout_usec - HADM_T_SY(hadm_config->rttPhy) - HADM_MODE0_TIMEOUT_MARGIN_US)))
    {
        /* Program the mode0 timeout (the actual duration of RX period) */
        rsm_config_p->mode0_timeout_usec = mode0_timeout_usec;
    }
    else
    {
        rsm_config_p->mode0_timeout_usec = 0; /* means no timeout */
    }
	
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 475)
    rsm_config_p->phase_comp_sel = XCVR_RSM_PHASE_COMP_DISABLED, /* Disables the phase compensation by default */
#endif /* defned(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 475)  */
    
    status = XCVR_LCL_ValidateRsmSettings(rsm_config_p);
    if (gXcvrLclStatusSuccess != status)
    {   goto config_error; }

    DEBUG_PIN1_CLR
    DEBUG_PIN1_SET 

    /* Build first configuration steps in PKT RAM: mode 0 steps without pushing RSM pointers */
    (void)lcl_hadm_set_steps_config(hadm_config->mode0Nb, hadm_meas_p, FALSE);
    
    /* Program RSM to start on NBU trigger + DELAY ahead of time */
    LCL_HAL_PROGRAM_RSM_TRIGGER(rsm_config_p->trig_sel, rsm_config_p->trig_delay);
    
    hadm_meas_p->state = HADM_HAL_MEAS_STATE_CONFIGURED;
    
    DEBUG_PIN1_CLR
    DEBUG_PIN0_CLR
      
    return HADM_HAL_SUCCESS;
    
config_error:

    assert(0);
    return HADM_HAL_FAIL;
}

BLE_HADM_STATUS_t lcl_hadm_run_measurement(const BLE_HADM_SubeventConfig_t *hadm_config_p)
{
    BLE_HADM_STATUS_t hal_status = HADM_HAL_SUCCESS;
    xcvrLclStatus_t status;
    hadm_meas_t *hadm_meas_p = lcl_hadm_get_meas_instance(hadm_config_p);
    hadm_proc_t *hadm_proc = &hadm_procs[hadm_config_p->connIdx];
    xcvr_lcl_rsm_config_t *rsm_config_p;
    uint32_t rsm_state;
#ifdef HADM_TRACK_RSM_INIT
    static uint32_t cyccnt_1;
    static int32_t elapsed_time;
#endif

    DEBUG_PIN0_SET

    /* Enable required RSM interrupts for SW FSM */
    LCL_HAL_RSM_SET_IRQ_ENABLE_MASK(LCL_HAL_RSM_XCVR_IRQ_ENABLE_MASK);

#ifdef HADM_TRACK_RSM_INIT
    DWT->CTRL |= 1;
    cyccnt_1 = DWT->CYCCNT;
#endif
    do
    {
        if (hadm_meas_p == NULL)
        {
            assert(false);
            hal_status = HADM_HAL_INVALID_ARGS;
            break;
        }
        rsm_config_p = &hadm_meas_p->rsm_config;

#ifdef UT_HADM_TRIGGER
        /* RSM should have started on NBU trigger and be in DELAY state */
        rsm_state = LCL_HAL_XCVR_GET_RSM_STATE();
        assert(rsm_state != LCL_HAL_XCVR_RSM_STATE_IDLE);
#endif

        /* At this point, the config must be valid and the procedure must have been initialized */
        if ((hadm_meas_p->state != HADM_HAL_MEAS_STATE_CONFIGURED) || (!hadm_proc->is_proc_init_done))
        {
            assert(false);
            hal_status = HADM_HAL_INVALID_ARGS;
            break;
        }
        
        /* Alloc result buffer */
        hadm_meas_p->result_p = lcl_hadm_utils_get_result_buffer();
        if (hadm_meas_p->result_p == NULL)
        {
#ifdef HAL_ENABLE_ASSERT_ON_STRESS
            assert(false);
#endif
            hal_status = HADM_HAL_MEMORY_FULL;
            break;
        }

        DEBUG_PIN1_SET

        hadm_device.active_meas_p = hadm_meas_p; /* becomes active measurement */
        hadm_meas_p->state = HADM_HAL_MEAS_STATE_RUNNING;

        hadm_meas_p->result_p->connIdx = hadm_config_p->connIdx;
        hadm_meas_p->result_p->subeventIdx = hadm_config_p->subeventIdx; /* echo subeventIdx */
        hadm_meas_p->result_p->syncDelayUs = 0;

        DEBUG_PIN1_PULSE

        if ((hadm_meas_p->config_p->mode != HADM_SUBEVT_TEST_MODE) || (hadm_meas_p->result_p->subeventIdx == 0U))
        {
            lcl_hadm_measurement_setup(hadm_proc, hadm_meas_p, hadm_config_p);
        }

        DEBUG_PIN1_PULSE

        /* Configure Antenna switching */
        lcl_hadm_utils_configure_antenna_switching(hadm_meas_p, hadm_device.paRampingAntSwitchEnabled);
        /* Configure TQI and start LCL if needed */
        if (rsm_config_p->op_mode != XCVR_RSM_SQTE_STABLE_PHASE_TEST_MODE)
        {
            if ((hadm_meas_p->debug_flags & HADM_DBG_FLG_AVG_OFF) == 0U)
            {
                lcl_hal_xcvr_program_tqi(hadm_meas_p);
            }
            LCL_HAL_START_LCL;
        }

        DEBUG_PIN1_PULSE

        /* Start DMA if needed */
#ifndef RSM_DBG_IQ
        if (((hadm_meas_p->debug_flags & HADM_DBG_FLG_IQ_DMA) != 0U) && ((hadm_meas_p->iq_buff_size > 0U) || (hadm_meas_p->iq_buff_size_mode0 > 0U)))
        {
            lcl_hal_xcvr_configure_dma_capture(LCL_START_DMA_ON_RSM_TRIGGER, 0, (uint32_t)hadm_meas_p->iq_buff_size + (uint32_t)hadm_meas_p->iq_buff_size_mode0, hadm_device.dma_debug_buff_size, hadm_device.dma_debug_buff_address);
            LCL_HAL_START_DMA(LCL_DMA_PAGE_RXDIGIQ);
        }
#else
        LCL_HAL_SET_IQ_CAPTURE_POINT(LCL_OUT_CH_FILTER_SEL);
        LCL_HAL_CLEAR_DMA_MASK_AND_AVG_WIN;
        lcl_hal_xcvr_configure_dma_capture(LCL_START_DMA_ON_TSM_RX_DIG_EN, 0, 0x2000, hadm_device.dma_debug_buff_size, hadm_device.dma_debug_buff_address);
        LCL_HAL_START_DMA(LCL_DMA_PAGE_RXDIGIQ);
#endif

        DEBUG_PIN1_PULSE

        if (HADM_IS_RSM_OPTIM_INACTIVE(hadm_config_p) ||
            (hadm_config_p->subeventIdx == 0U))
        {
            /* Configure RSM block. Will start on NBU HW trigger */
            status = XCVR_LCL_RsmInit(rsm_config_p);
            assert(gXcvrLclStatusSuccess == status);
            (void)status;

            status = XCVR_LCL_Set_TSM_FastStart(rsm_config_p->role, rsm_config_p);
            assert(gXcvrLclStatusSuccess == status);
            (void)status;

            if (fem_active == 1U)
            {
                /* FEM is active, apply to XCVR. Backup & restore of BLE's TIMING07, TIMING08 are done.
                   XCVR_ANALOG->LDO_1 & XCVR_MISC->FAD_CTRL are not changed */
                xcvrStatus_t xcvr_status = XCVR_ExternalFadPaFemInit(&pa_fem_config);
                assert(xcvr_status == gXcvrSuccess_c);
                (void)xcvr_status;
            }
        }
        else
        {
            uint32_t temp;
            /* For testmode, RSM config does not need to be reapplied, simply set number of steps */
            temp = XCVR_MISC->RSM_CTRL0 & ~XCVR_MISC_RSM_CTRL0_RSM_STEPS_MASK;
            temp |= XCVR_MISC_RSM_CTRL0_RSM_STEPS((uint32_t)rsm_config_p->num_steps);
            temp |= (rsm_config_p->role == XCVR_RSM_TX_MODE ? XCVR_MISC_RSM_CTRL0_RSM_TX_EN_MASK :
                                                            XCVR_MISC_RSM_CTRL0_RSM_RX_EN_MASK);
            XCVR_MISC->RSM_CTRL0 = temp;

