nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
        }

        /* Setup BT=2 modulation if needed */
        if (hadm_config_p->rttPhy == HADM_RTT_PHY_2MBPS_2BT)
        {
            DEBUG_PIN1_TGL
            lcl_enable_BT2p0_modulation();
            DEBUG_PIN1_TGL
        }

        assert(gXcvrLclStatusSuccess == status);
        (void)status;

        LCL_HAL_ENABLE_TONE_OBS

        DEBUG_PIN1_PULSE

        /* Configure PKT RAM circular buffers to be used by RSM */
        lcl_hal_pkt_ram_config_circ_buffers(&hadm_meas_p->pkt_ram);
        /* make sure PLL_OFFSET_CTRL is cleared before first mode 0 */
        (void)XCVR_LCL_RsmCompCfo(0);

        /* End of critical configuration section: past this point, the RSM is supposed to exit SM_STATE_DELAY */
        DEBUG_PIN0_PULSE

#ifdef HADM_TRACK_RSM_INIT
        /* compute elapsed time since function entry - wrap is handled */
        elapsed_time = (uint32_t)((int32_t)DWT->CYCCNT - (int32_t)cyccnt_1)/hadm_device.sys_clock_freq;
        assert(elapsed_time < (hadm_meas_p->rsm_trigger_delay - HADM_HAL_RSM_TRIGGER_DELAY_MARGIN));
        (void)elapsed_time;
#endif /* HADM_TRACK_RSM_INIT */

#ifdef SIMULATOR
        status +=  SIMU_LCL_RsmGo(rsm_config_p->role, rsm_config_p);
#else
        rsm_state = LCL_HAL_XCVR_GET_RSM_STATE();
#ifdef HAL_ENABLE_ASSERT_ON_STRESS
        assert(rsm_state == LCL_HAL_XCVR_RSM_STATE_DELAY);
#endif
        if (rsm_state != LCL_HAL_XCVR_RSM_STATE_DELAY)
        {
            hal_status = HADM_HAL_COLLISION;
            break;
        }
#endif

        /* Check that subevent has some main mode steps (may have zero non-mode0 steps if procedure reaches 256 steps) */
        if (hadm_meas_p->config_p->stepsNb > hadm_meas_p->config_p->mode0Nb)
        {
            /* Build first non-mode0 configuration step in PKT RAM while subevent starts */
            (void)lcl_hadm_set_steps_config(HADM_HAL_PKT_RAM_NB_STEPS_CONFIG_INITIAL, hadm_meas_p, TRUE);
        }
    } while(false);
#ifdef HADM_TRACK_RSM_INIT
    DWT->CTRL &= ~1;
#endif

    if ((hal_status != HADM_HAL_SUCCESS) && (hadm_meas_p != NULL))
    {
        /* Disable all RSM interrupts - synchronous cleanup */
        LCL_HAL_RSM_SET_IRQ_ENABLE_MASK(0);
        lcl_hadm_measurement_shutdown(hadm_meas_p, true);
        BLE_HADM_ReleaseResultsBuffer(&hadm_meas_p->result_p);
        ((BLE_HADM_SubeventConfig_t*)hadm_meas_p->config_p)->configBufferUsed = 0U;
        lcl_hadm_measurement_cleanup(hadm_meas_p);
    }
    DEBUG_PIN1_CLR
    DEBUG_PIN0_CLR

    return hal_status;
}

/* Stop one subevent */
void lcl_hadm_stop_measurement(const BLE_HADM_SubeventConfig_t *config)
{
    DEBUG_PIN0_SET
    
    hadm_meas_t *hadm_meas_p = lcl_hadm_get_meas_instance(config);
    assert(hadm_meas_p != NULL);
    assert(hadm_meas_p->config_p != NULL);
    assert(hadm_meas_p->state != HADM_HAL_MEAS_STATE_IDLE);

    if (hadm_meas_p->state == HADM_HAL_MEAS_STATE_RUNNING)
    {
        hadm_meas_p->state = HADM_HAL_MEAS_STATE_ABORTING;
        /* Abort RSM, this will set ABORT flag, trigger EOS IRQ, wait for RSM to switch to IDLE */
        XCVR_LCL_RsmStopAbort(TRUE);
        /* Note: Various buffers will be freed as part of regular RSM EOS/Abort code path */
    }
    else
    {
        /* No EOS IRQ will be triggered, simply free resources */
        ((BLE_HADM_SubeventConfig_t*)hadm_meas_p->config_p)->configBufferUsed = 0U;
        lcl_hadm_measurement_cleanup(hadm_meas_p);
    }

    DEBUG_PIN0_CLR
}

/* Stop a whole procedure */
void lcl_hadm_stop_procedure(uint8 connIdx)
{
    DEBUG_PIN0_SET
    
    hadm_meas_t *hadm_meas_p = hadm_device.active_meas_p;
    if (hadm_meas_p != NULL)
    {
        /* we have a subevent in HADM_HAL_MEAS_STATE_RUNNING state on the connIdx beeing shut down */
        if (hadm_meas_p->config_p->connIdx == connIdx)
        {
            lcl_hadm_stop_measurement(hadm_meas_p->config_p);
        }
    }
    else
    {
        /* Config has been created, but no subevent running yet */
        lcl_hadm_utils_free_config_buffer(connIdx);
    }

    /* End of procedure, clean context */
    hadm_procs[connIdx].is_proc_init_done = false;
    
    DEBUG_PIN0_CLR
}

/* === Implementation (static) ============================================= */

static void lcl_hadm_measurement_setup(hadm_proc_t *hadm_proc, hadm_meas_t *hadm_meas_p, const BLE_HADM_SubeventConfig_t *hadm_config)
{
#ifndef SIMULATOR
    lcl_hal_xcvr_hadm_init(&hadm_device, hadm_meas_p, hadm_config);
#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
    if (hadm_config->role != HADM_ROLE_REFLECTOR)
    {
        /* In this mode, an additional per-step IRQ is setup with higher priority than RSM IRQ, in order to program CFO via Fast Override Module */
        lcl_hadm_enable_interrupts_for_subevent(hadm_config->role == HADM_ROLE_INITIATOR);
        /* FOM override occurs on fom_tx/tx_en or fom_rx/rx_en which happens before TSM raises the IT, so will apply to the next step. */
        LCL_HAL_SET_PLL_OFFSET_FO_ENTRY();
    }
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */
#endif /* SIMULATOR */
}

static hadm_meas_t *lcl_hadm_alloc_meas_instance(void)
{
    hadm_meas_t *meas_p = NULL;
    for (int i=0; i<(int)HADM_MAX_NB_SIMULT_SUBEVENTS ; i++)
    {
        if (hadm_meas[i].state == HADM_HAL_MEAS_STATE_IDLE)
        {
            meas_p = &hadm_meas[i];
            meas_p->config_p = NULL;
            meas_p->result_p = NULL;
            break;
        }
    }
    return meas_p;
}

static void lcl_hadm_free_meas_instance(hadm_meas_t *meas_p)
{
    meas_p->state = HADM_HAL_MEAS_STATE_IDLE;
    meas_p->config_p = NULL;
    meas_p->result_p = NULL;
}

static hadm_meas_t *lcl_hadm_get_meas_instance(const BLE_HADM_SubeventConfig_t *config_p)
{
    hadm_meas_t *meas_p = NULL;
    for (int i=0; i<(int)HADM_MAX_NB_SIMULT_SUBEVENTS ; i++)
    {
        if (hadm_meas[i].config_p == config_p)
        {
            meas_p = &hadm_meas[i];
            break;
        }
    }
    return meas_p;
}

static void lcl_hadm_measurement_shutdown(hadm_meas_t *hadm_meas_p, bool_t abort_subevent)
{
#ifndef SIMULATOR
    /* Make sure all HW blocks are stopped */
    XCVR_LCL_RsmStopAbort(abort_subevent);
    LCL_HAL_STOP_LCL;
#ifndef RSM_DBG_IQ
    if ((hadm_meas_p->debug_flags & HADM_DBG_FLG_IQ_DMA) != 0U)
#endif
    {
        LCL_HAL_DISABLE_DMA;
    }
    /* Do not restore XCVR state if RSM optim is active (except for the last subevent) */
    if (HADM_IS_RSM_OPTIM_INACTIVE(hadm_meas_p->config_p) ||
        ((hadm_meas_p->config_p->typeFlags & HADM_SUBEVT_LAST) != 0U))
    {
        lcl_hal_xcvr_hadm_deinit(hadm_meas_p->config_p);
    }
#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
    if (hadm_meas_p->config_p->role != HADM_ROLE_REFLECTOR)
    {
        lcl_hadm_restore_interrupts_for_subevent();
    }
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */
    lcl_hadm_consume_drbg(hadm_meas_p);
#endif /* SIMULATOR */
}

/* Release measurement resources and reset device state for next measurement.
 * If this is the last subevent in a procedure, also clean procedure context.
 */
static void lcl_hadm_measurement_cleanup(hadm_meas_t *hadm_meas_p)
{
    if ((hadm_meas_p->config_p->typeFlags & HADM_SUBEVT_LAST) != 0U)
    {
        /* End of procedure, clean context */
        hadm_procs[hadm_meas_p->config_p->connIdx].is_proc_init_done = false;
    }
    lcl_hadm_free_meas_instance(hadm_meas_p);
}

/*!
 * This function is used to write subevent steps (#n_steps) configuration to PKT RAM Config circular buffer
 * This is called before subevent start (by BLE_HADM_SubeventConfigApply()) or by RSM step interrupt IRQ
 */
static BLE_HADM_STATUS_t lcl_hadm_set_steps_config(uint16 n_steps, hadm_meas_t *hadm_meas_p, bool_t update_rsm_ptr)
{
    uint32_t step_idx;
    hadm_circ_buff_desc_t *circ_buff_p = &hadm_meas_p->pkt_ram.step_config;
    BLE_HADM_Chan_Mode_PmExt_AntPerm_t *step_config_p;
#ifdef HADM_CFO_COMP_PER_STEP_VIA_PKTRAM
    hadm_proc_t *hadm_proc = &hadm_procs[hadm_meas_p->config_p->connIdx];
    bool_t compensate_cfo = (hadm_meas_p->config_p->role != HADM_ROLE_REFLECTOR) && (hadm_proc->ppm != 0) && ((hadm_meas_p->debug_flags & HADM_DBG_FLG_CFO_COMP_DIS) == 0U);
#endif
    int16_t cfo = 0;
    uint8_t aa_offset = 1U - ((uint8_t)hadm_meas_p->config_p->role & 0x1U); /* offset to Rx AA. & 0x1U to avoid wrong index with HADM_ROLE_SNIFFER */
    uint8_t cs_sync_ant_id = 0U;
    
