nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    DEBUG_PIN1_SET

    assert(circ_buff_p->curr_step_idx < hadm_meas_p->config_p->stepsNb);
    n_steps = MIN(n_steps, (uint16)hadm_meas_p->config_p->stepsNb - (uint16)circ_buff_p->curr_step_idx);

    for (step_idx = 0; step_idx < (uint32_t)n_steps; step_idx++)
    {
        uint16_t hpm_cal_val;

        if ((hadm_meas_p->pkt_ram.config_write_ptr + circ_buff_p->max_step_size) > circ_buff_p->base_ptr + circ_buff_p->buff_len)
        {
            /* Need to wrap now: rewind write pointer to start and toggle page */
            hadm_meas_p->pkt_ram.config_write_ptr = circ_buff_p->base_ptr;
            circ_buff_p->curr_page ^= 1U;
        }
        
        step_config_p = &hadm_meas_p->config_p->chModePmAntMap[circ_buff_p->curr_step_idx];

        /* Compute HPM cal factor */
#ifdef HADM_PLL_CAL_INTERPOLATION
        if (step_config_p->mode == HADM_STEP_MODE2)
        {
            /* Per-step HPM cal not used for mode2 */
            hpm_cal_val = 0;
        }
        else /* mode 0, 1 or 3 */
        {
            /* Per-step HPM cal for packets - interpolated */
            hpm_cal_val = lcl_hadm_get_hpm_cal_interpolation((uint8_t)step_config_p->channel, hadm_device.cal_ch40[hadm_meas_p->config_p->rttPhy].hpm_cal_val);
        }
#else
        hpm_cal_val = hadm_device->cal_data[hadm_meas_p->config_p->rttPhy][step_config_p->channel].hpm_cal_val;
#endif
#ifdef HADM_CFO_COMP_PER_STEP_VIA_PKTRAM
        /* Compute CFO compensation */
        if (compensate_cfo && (step_config_p->mode != HADM_STEP_MODE0))
        {
            cfo = LCL_HAL_COMPUTE_STEP_CFO(hadm_proc->cfo_channel, step_config_p->channel, hadm_proc->ppm);
        }
#endif
        /* Compute CS_SYNC antenna ID to be used for this step */
        if (step_config_p->mode != HADM_STEP_MODE2)
        {
            cs_sync_ant_id = lcl_hadm_utils_get_CS_SYNC_antenna(hadm_meas_p);
        }

        /* RSM timing requires TONE_EXT to be set for correct Stable Phase test TX timing */
        if (hadm_meas_p->rsm_config.op_mode == XCVR_RSM_SQTE_STABLE_PHASE_TEST_MODE)
        {
          step_config_p->pm_ext = 0x3U;
        }
        /* Build common config header to PKT RAM circular buffer */
        LCL_HAL_BUILD_PKT_RAM_CONFIG_STEP(step_config_p, hadm_meas_p->pkt_ram.config_write_ptr, (uint16_t)cfo, hpm_cal_val, cs_sync_ant_id, hadm_meas_p->config_p->role);

        /* COMMON MODE 13 */
        if (step_config_p->mode != HADM_STEP_MODE2)
        {
            uint32_t nb_words_written;
            BLE_HADM_rttType_t rtt_type = (step_config_p->mode == HADM_STEP_MODE0) ? HADM_RTT_TYPE_CS_AA_ONLY_TIMING : hadm_meas_p->config_p->rttTypes;

            /* Build AAs and payloads to PKT RAM circular buffer */
            DEBUG_PIN1_SET
            if (step_config_p->mode == HADM_STEP_MODE0)
            {
                /* For mode0, AAs have been computed in advanced and are available in HAL config buffer */
                nb_words_written = 2U; /* pn1 and pn2 */
                *hadm_meas_p->pkt_ram.config_write_ptr = hadm_meas_p->config_p->pnList[step_idx].pn1;
                *(hadm_meas_p->pkt_ram.config_write_ptr + 1U) = hadm_meas_p->config_p->pnList[step_idx].pn2;
            }
            else
            {
                /* For non-mode0, AAs and payloads have to be computed on the flight */
                nb_words_written = BLE_HADM_DRBG_Generate_CS_SYNC_step(hadm_meas_p->config_p->connIdx, hadm_meas_p->config_p->subeventIdx,
                                                                                circ_buff_p->curr_step_idx,
                                                                                rtt_type, hadm_meas_p->pkt_ram.config_write_ptr);
            }
            hadm_meas_p->pkt_ram_data_in_flight[hadm_meas_p->data_in_flight_w_idx].cs_sync_ant_id = cs_sync_ant_id;
            hadm_meas_p->pkt_ram_data_in_flight[hadm_meas_p->data_in_flight_w_idx].aa_rx = *(hadm_meas_p->pkt_ram.config_write_ptr + aa_offset);
#ifdef HADM_UT_MODE0_TIMEOUT
            if ((step_config_p->mode == HADM_STEP_MODE0) && (circ_buff_p->curr_step_idx < 2) && (hadm_meas_p->config_p->role == HADM_ROLE_REFLECTOR))
            {
                *(hadm_meas_p->pkt_ram.config_write_ptr) ^= 1;
            }
#endif
            hadm_meas_p->pkt_ram.config_write_ptr += nb_words_written;
            if (++hadm_meas_p->data_in_flight_w_idx >= HADM_HAL_PKT_RAM_IN_FLIGHT_DATA_BUFFER_SIZE)
            {
                hadm_meas_p->data_in_flight_w_idx = 0;
            }
            assert(hadm_meas_p->data_in_flight_w_idx != hadm_meas_p->data_in_flight_r_idx);
            DEBUG_PIN1_CLR
        }
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN > 470)
        /* COMMON MODE 23 */
        if ((step_config_p->mode == HADM_STEP_MODE2) || (step_config_p->mode == HADM_STEP_MODE3))
        {
            /* Mode2-specific fields */
            *hadm_meas_p->pkt_ram.config_write_ptr++ = 0; /* phase_add_ap1-4 */
        }
#endif // NXP_RADIO_GEN == 470
        if (update_rsm_ptr)
        {
            LCL_HAL_UPDATE_PKT_RAM_CONFIG_STEP_PTR(circ_buff_p->curr_page, hadm_meas_p->pkt_ram.config_write_ptr);
        }
        circ_buff_p->curr_step_idx++;
    }
    
    DEBUG_PIN1_CLR
          
    return HADM_HAL_SUCCESS;
}

/*
 * Brute force to consume DRBG context to re-sync after a missed subevent.
 * All DRBG transactions are consumed when preparing the procedure, except those below which are consumed as the subevent runs.
 * - CS_SYNC AA
 * - CS_SYNC payloads
 * Note that, for CS_SYNC AA, there is no need to resync since they are processed by chunks of 128 bits, so taBitsUsed is always 128
 * which will triger generation of new bits on next invocation.
 */
static void lcl_hadm_consume_drbg(hadm_meas_t *hadm_meas_p)
{
    uint32_t step_idx;

    DEBUG_PIN1_SET

    for (step_idx = hadm_meas_p->pkt_ram.step_config.curr_step_idx; step_idx < hadm_meas_p->config_p->stepsNb; step_idx++)
    {
        BLE_HADM_Chan_Mode_PmExt_AntPerm_t * step_config_p = hadm_meas_p->config_p->chModePmAntMap + step_idx;
        if ((step_config_p->mode == HADM_STEP_MODE1) || (step_config_p->mode == HADM_STEP_MODE3))
        {
            /* Build AAs and payloads to PKT RAM circular buffer */
            (void) BLE_HADM_DRBG_Generate_CS_SYNC_step(hadm_meas_p->config_p->connIdx,
                                                        hadm_meas_p->config_p->subeventIdx,
                                                        (uint8)step_idx,
                                                        hadm_meas_p->config_p->rttTypes,
                                                        NULL);
        }
    }
    hadm_meas_p->pkt_ram.step_config.curr_step_idx = hadm_meas_p->config_p->stepsNb;

