nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    DEBUG_PIN1_CLR
}

/*!
 * This function is used to perform specific actions on last mode 0 reception:
 * - lock AGC
 * - Compute ppm (CFO)
 */
static BLE_HADM_STATUS_t lcl_hadm_handle_last_mode0(hadm_meas_t *hadm_meas_p)
{
    uint32_t step_idx;
    BLE_HADM_Chan_Mode_PmExt_AntPerm_t *step_config_p = &hadm_meas_p->config_p->chModePmAntMap[0];
    hadm_info_t *hadm_info_p = &hadm_meas_p->info;
    hadm_proc_t *hadm_proc = &hadm_procs[hadm_meas_p->config_p->connIdx];
    uint8_t mode0Nb = hadm_meas_p->config_p->mode0Nb;
    bool_t proc_agc_locked = (hadm_proc->agc_idx != 0xFFU);
    hadm_sync_info_t *sync_info_p;
    BLE_HADM_STATUS_t status;
    
    DEBUG_PIN1_SET

    /* Select best mode0 (smallest AGC index to limit IQ saturation) */
    for (step_idx = 0; step_idx < mode0Nb; step_idx++)
    {
        sync_info_p = &hadm_meas_p->sync_info[step_idx];
        if (sync_info_p->valid != 0U)
        {
            hadm_meas_p->mode0_complete = true;

            /* If procedure has not locked its AGC yet (didn't get a subevent with at least one valid mode0) */
            /* look for smallest gain amongst valid mode 0's */
            if (!proc_agc_locked)
            {
                if (hadm_proc->agc_idx > sync_info_p->agc_idx)
                {
                    hadm_info_p->sync_step_id = (uint8_t)step_idx;
                    /* Record AGC index and keep the smallest */
                    hadm_proc->agc_idx = sync_info_p->agc_idx;
                    /* Record the estimated CFO and channel used for CFO estimation */
                    hadm_proc->cfo = sync_info_p->cfo;
                    hadm_proc->cfo_channel = (uint8_t)step_config_p[step_idx].channel;
                }
            }
        }
    }

    if (hadm_meas_p->config_p->role == HADM_ROLE_SNIFFER)
    {
        /* If procedure has not locked its AGC yet (didn't get a subevent with at least one valid mode0) */
        /* look for smallest gain amongst valid mode 0's on sniffer's reflector channel */
        if (!proc_agc_locked)
        {
            hadm_sync_info_t *sync_info2_p;
            for (step_idx = 0; step_idx < mode0Nb; step_idx++)
            {
                sync_info2_p = &hadm_meas_p->sync_info2[step_idx];
                if (hadm_proc->agc_idx2 > sync_info2_p->agc_idx)
                {
                    /* Record AGC index and keep the smallest */
                    hadm_proc->agc_idx2 = sync_info2_p->agc_idx;
                    /* Override the estimated CFO and channel used for CFO estimation.
                     * Sniffer will use CFO vs Reflector as the Initiator will compensate its own CFO vs Reflector.
                     */
                    hadm_proc->cfo = sync_info2_p->cfo;
                    hadm_proc->cfo_channel = (uint8_t)step_config_p[step_idx].channel;
                }
            }
        }
    }

    if (!proc_agc_locked)
    {
        /* Compute ppm based on measured CFO */
        hadm_proc->ppm = (int16_t)((hadm_proc->cfo * HADM_PPM_DIVIDER)/ ((int32_t)(uint32_t)HADM_CHAN_NUM_TO_MHZ((uint32_t)hadm_proc->cfo_channel)));
    }

    if (hadm_meas_p->mode0_complete)
    {
        /* Freeze AGC according to the index from the retained mode 0 */
        lcl_hal_xcvr_set_rxgain(hadm_proc->agc_idx);
        if (hadm_meas_p->config_p->role == HADM_ROLE_SNIFFER)
        {
            lcl_hal_xcvr_set_rxgain2(hadm_proc->agc_idx2);
        }

        /* Readjust DCOC calibration based on gain (DC residual impacts RTT 2Mbps dispersion in particular) */
        XCVR_LCL_OverrideDcoc(XCVR_LCL_CombineCoarseFineDc(&hadm_device.dcoc_cal_results[hadm_meas_p->config_p->rttPhy], hadm_proc->agc_idx), true);

        /* fallback to one shot RSSI */
        lcl_hal_xcvr_setup_rssi_continuous(false);

        /* Enable TxSNR which applies to "the transmission of CS_SYNC packets used in mode-1 and mode-3 steps".*/
        {
            XCVR_RSM_TX_SNR_T tx_snr_setting = (hadm_meas_p->config_p->Tx_Snr < (uint8)XCVR_RSM_TX_SNR_DISABLED)?(XCVR_RSM_TX_SNR_T)hadm_meas_p->config_p->Tx_Snr:XCVR_RSM_TX_SNR_DISABLED;
            (void)XCVR_LCL_ConfigureTxSnr(tx_snr_setting, (XCVR_RSM_PHY_T)hadm_meas_p->config_p->rttPhy);
        }

        /* Compute CFO & time grid adjustment */
        if (hadm_meas_p->config_p->role != HADM_ROLE_REFLECTOR)
        {
            if ((hadm_meas_p->debug_flags & HADM_DBG_FLG_CFO_COMP_DIS) == 0U)
            {
#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
                int32_t cfo;
                /* Enable FOM entry trigger for next step. TX trigger if initator, RX trigger otherwise. */
                LCL_HAL_ENABLE_FO_ENTRY(hadm_meas_p->config_p->role == HADM_ROLE_INITIATOR);
                /* Compute CFO compensation to apply at next step */
                /* Initiator or sniffer */
                cfo = LCL_HAL_COMPUTE_CHANNEL_CFO(hadm_meas_p->config_p->chModePmAntMap[mode0Nb].channel,
                                                  hadm_proc->ppm);
                (void)lcl_hadm_apply_cfo_per_step(cfo);
#else
                /* Initial CFO compensation */
                XCVR_LCL_RsmCompCfo(-hadm_proc->cfo);
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */

#ifdef HADM_CFO_COMP_PER_STEP_VIA_PKTRAM
                /* Update CFO programmed for already-built config steps */
                /* At this point only 1 step has been prepared in addition of the mode 0 steps */
                hadm_circ_buff_desc_t *circ_buff_p = &hadm_meas_p->pkt_ram.step_result;
                int16_t step_cfo;
                step_idx = mode0Nb + 1U;

                step_cfo = LCL_HAL_COMPUTE_STEP_CFO(hadm_proc->cfo_channel, step_config_p[step_idx].channel, hadm_proc->ppm);
              
                circ_buff_p = &hadm_meas_p->pkt_ram.step_config;
                assert(circ_buff_p->curr_step_idx == step_idx);
                uint32_t *config_write_ptr = circ_buff_p->base_ptr + (mode0Nb * LCL_HAL_PKT_RAM_STEP_CONFIG_MODE0_SIZE); /* skip mode 0s */
                
                LCL_HAL_UPDATE_CFO_IN_PKT_RAM_CONFIG_STEP(config_write_ptr, step_cfo);
#endif
            }
            
            /* Program time-grid adjustment (Initiator only) */
            lcl_hal_xcvr_program_time_adjustement((int32_t)hadm_proc->ppm/HADM_PPM_DIVIDER);
        }
        if (hadm_meas_p->config_p->role == HADM_ROLE_REFLECTOR)
        {   /* Reflector Only */
            /*
             * In some PKT-Tone cases, cfo_est may be non-null (depends on received AA) after PKT Rx, affecting badly tone phase.
             * To workaround this effect, we force cfo_est to zero by enabling ovveride.
             * Affected register XCVR_RX_DIG->CTRL1 is part of XCVR backup/restore.
             */
            LCL_HAL_SETUP_PKT_TONE_RX();
        }
        status = HADM_HAL_SUCCESS;
    }
    else
    {
        status = HADM_HAL_ABORTED_SYNC;
    }
    DEBUG_PIN1_CLR

