nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
            /* Store Step_Data */
            if (step_config_p->mode == HADM_STEP_MODE0)
            {
                bool vld = (bool)hadm_meas_p->sync_info[step_mode0_no].valid;
                /* (Hz*100) / MHz  => 0.01 ppm unit */
                int32_t ppm = (hadm_meas_p->sync_info[step_mode0_no].cfo * HADM_PPM_DIVIDER) / (int32_t)(uint32_t)HADM_CHAN_NUM_TO_MHZ((uint32_t)step_config_p->channel);
                *res_buff_p++ = (uint8_t)BLE_HADM_STEP0_REPORT_SIZE(role); /* Step_Data_Length */
                *res_buff_p++ = (uint8_t)HADM_SET_RTT_AA_QUALITY(vld); /* Packet_AA_Quality */
                *res_buff_p++ = (uint8_t)HADM_SET_RTT_RSSI(vld, hadm_meas_p->sync_info[step_mode0_no].rssi); /* Packet RSSI */
                *res_buff_p++ = hadm_meas_p->pkt_ram_data_in_flight[hadm_meas_p->data_in_flight_r_idx].cs_sync_ant_id + 1U;  /* Packet_Antenna (1 byte) */
                if (role == HADM_ROLE_INITIATOR)
                {
                    HADM_SET_RTT_CFO(vld, ppm, res_buff_p); /* Measured_Freq_Offset (2 bytes) */
                }
                if (!synch_done && vld)
                {
                    /* Compute final value for syncDelayUs which represents time starting from RSM trigger */
                    /* syncOffsetUs = RSM_TRIGGER_DELAY + TPM timestamp - pkt_header_duration - aa_match_delay */
                    hadm_meas_p->result_p->syncDelayUs = (uint16_t)HADM_RTT_TS_TO_US(tpm);
                    assert((hadm_meas_p->rsm_trigger_delay + hadm_meas_p->result_p->syncDelayUs) > (HADM_1ST_BIT_TO_AA_MATCH_DURATION_US(hadm_meas_p->config_p->rttPhy)));
                    hadm_meas_p->result_p->syncDelayUs = hadm_meas_p->result_p->syncDelayUs + hadm_meas_p->rsm_trigger_delay - HADM_1ST_BIT_TO_AA_MATCH_DURATION_US(hadm_meas_p->config_p->rttPhy);
                    hadm_meas_p->result_p->syncDelayUs -= (step_mode0_no * hadm_meas_p->step_duration[0]); /* cope for missed mode0s */
                    synch_done = TRUE;
                }
                step_mode0_no++;
                rtt_pkt_no++;
            }
            else
            {
                assert(step_config_p->mode <= HADM_STEP_MODE3);

                if ((step_config_p->mode == HADM_STEP_MODE1) || (step_config_p->mode == HADM_STEP_MODE3))
                {
                    xcvr_lcl_rtt_data_t rtt_data;
                    int32_t frac_delay = 0;
                    int32_t rtt_ts = 0;
                    uint8_t nadm_metric = 0xFF; /* NADM not available by default */
                    uint8_t nadm_symb_err = 0x0U; 
                    rtt_pkt_no++;
                    (void)XCVR_LCL_UnpackRttResult((xcvr_lcl_rtt_data_raw_t *)(void *)&rtt_data_raw, &rtt_data, LCL_HAL_PHY_TO_XCVR_RATE(rtt_phy));
                    if (rtt_data.rtt_vld && rtt_data.rtt_found)
                    {
                        int32_t ffo_correction = 0;
                        DEBUG_PIN1_SET
                        /* Compute integer and fractional adjustment in ns */
                        frac_delay = lcl_hadm_hartt_compute_fractional_delay((LCL_HADM_rttPhy_t)rtt_phy, hadm_meas_p->pkt_ram_data_in_flight[hadm_meas_p->data_in_flight_r_idx].aa_rx,
                                                                             (int16_t)rtt_data.p_delta, (int32_t)rtt_data.int_adj);
#ifdef RTT_DEBUG
                        rtt_frac_dbg_buffer[circ_buff_p->curr_step_idx] = frac_delay;
                        rtt_p_delta_dbg_buffer[circ_buff_p->curr_step_idx] = rtt_data.p_delta;
                        rtt_int_adj_dbg_buffer[circ_buff_p->curr_step_idx] = rtt_data.int_adj;
#endif
                        if (role == HADM_ROLE_REFLECTOR)
                        {
                            frac_delay = -frac_delay; /* On reflector side, substract frac delay */
                        }
                        DEBUG_PIN1_CLR

                        /* in half ns to keep ts_delay_hns precision */
                        rtt_ts = ((int32_t)(uint32_t)HADM_RTT_TS_TO_NS(tpm) + frac_delay)*2;
                        rtt_ts = rtt_ts - (int32_t)hadm_meas_p->ts_hw_delay_hns;
                        if (role == HADM_ROLE_INITIATOR)
                        {
                            /* "Device A shall implement frequency-based timing compensation" */
                            /* ppm is expressed in 0.01 ppm */
                            ffo_correction = (int32_t)(((int64_t)rtt_ts * hadm_proc_p->ppm)/100000000);
                        }
                        rtt_ts = rtt_ts - (int32_t)hadm_meas_p->ts_nominal_delay_hns + ffo_correction;
                        if ((step_config_p->mode == HADM_STEP_MODE3) && ((step_config_p->pm_ext & 0x1U) != 0U))
                        {
                            /* Remove an extra T_PM + T_SW in mode 3 case if required */
                            rtt_ts -= (int32_t)hadm_meas_p->ts_extra_delay_hns;
                        }
                        if ((rtt_ts < -32768) || (rtt_ts > 32767))
                        {
#ifndef SIMULATOR
                            //assert(false);
#endif
                            //rtt_data.rtt_vld = false;
                            rtt_ts = 12345; /* OJE TODO */
                        }
                        if (hadm_meas_p->config_p->rttTypes != HADM_RTT_TYPE_CS_AA_ONLY_TIMING)
                        {
                            uint32_t nadm_fm_corr_value = ((nadm_error & COM_MODE_013_RES_BODY_NADM_ERROR_RSSI_RAW_NADM_FM_CORR_VALUE_MASK)>>COM_MODE_013_RES_BODY_NADM_ERROR_RSSI_RAW_NADM_FM_CORR_VALUE_SHIFT);
                            XCVR_LCL_NormalizeNadmRawMetric((XCVR_RSM_RTT_TYPE_T)hadm_meas_p->config_p->rttTypes, nadm_fm_corr_value, (int16_t)fm_corr_target);
                            XCVR_LCL_CalcNadmMetric(nadm_fm_corr_value, (int16_t)fm_corr_target, (int16_t)fm_corr_div, nadm_metric);
                            nadm_symb_err = (uint8_t)((nadm_error & COM_MODE_013_RES_BODY_NADM_ERROR_RSSI_RAW_NADM_FM_SYMB_ERR_VALUE_MASK)>>COM_MODE_013_RES_BODY_NADM_ERROR_RSSI_RAW_NADM_FM_SYMB_ERR_VALUE_SHIFT);
                        }
                    }
                    if (step_config_p->mode == HADM_STEP_MODE1)
                    {
                        *res_buff_p++ = BLE_HADM_STEP1_REPORT_SIZE; /* Step_Data_Length */
                    }
                    else
                    {
                        *res_buff_p++ = BLE_HADM_STEP3_REPORT_SIZE(hadm_meas_p->n_ap); /* Step_Data_Length */
                    }
                    *res_buff_p++ = (((nadm_symb_err << 4U) & 0xF0U) | (uint8_t)HADM_SET_RTT_AA_QUALITY(rtt_data.rtt_vld)); /* Payload_errors[7:4] | Packet_AA_Quality[3:0] (1 byte) */
                    *res_buff_p++ = nadm_metric; /* Packet_NADM */
                    *res_buff_p++ = (uint8_t)HADM_SET_RTT_RSSI(rtt_data.rtt_vld, (int8_t)rssi_nb); /* Packet_RSSI (1 byte) */
                    HADM_SET_RTT_TS_DIFF(rtt_data.rtt_vld, rtt_ts, res_buff_p); /* ToX-ToX time diff (2 bytes) */
                    *res_buff_p++ = hadm_meas_p->pkt_ram_data_in_flight[hadm_meas_p->data_in_flight_r_idx].cs_sync_ant_id + 1U;  /* Packet_Antenna (1 byte) */
                }

                if (step_config_p->mode != HADM_STEP_MODE1)    /* MODE2 and MODE3 */
                {
                    int pm_ext_ap_ind = 0;
                    uint32_t curr_iq;
                    uint8_t ant_id_seq[HADM_MAX_NB_ANTENNA_PATHS];
                    if (step_config_p->mode == HADM_STEP_MODE2)
                    {
                        *res_buff_p++ = BLE_HADM_STEP2_REPORT_SIZE(hadm_meas_p->n_ap); /* Step_Data_Length */
                    }
                    *res_buff_p++ = (uint8_t)step_config_p->ant_perm; /* Antenna_Permutation_Index */
                    bool_t ipt_refl = (hadm_meas_p->config_p->inlinePhaseReturn == 1U) && (hadm_meas_p->config_p->role == HADM_ROLE_REFLECTOR);
                    /* Store PCT[ap], 3 bytes each 22 significant bits  +  Tone Quality Indicator [ap] (1 byte each) */
                    lcl_hadm_utils_get_antenna_id_sequence(hadm_meas_p, circ_buff_p->curr_step_idx, ant_id_seq);
                    for(ap = 0; ap < (int)hadm_meas_p->n_ap; ap++)
                    {
                        HADM_DECODE_HW_RTP_PCT(iq[ap], ipt_refl, curr_iq);
                        if (!ipt_refl)
                        {
                            /* Do not rotate PCTs as it has no effect on IPT HW implementation and it would corrupt Q=0 */
                            lcl_hadm_measurement_phase_rotation(&curr_iq, (uint8_t)step_config_p->channel, ant_id_seq[ap]);
                        }
                        HADM_ENCODE_HCI_RTP_PCT(curr_iq, res_buff_p);
                        HADM_SET_RTP_TONE_QUALITY(iq[ap], res_buff_p, 0U/*NA*/);
                        pm_ext_ap_ind = ap;
                    }
                    /* Determine if N_AP+1 PCT has been received or not */
                    if ((step_config_p->mode == HADM_STEP_MODE2) || (role == HADM_ROLE_REFLECTOR) || ((step_config_p->pm_ext & 0x1U) != 0U))
                    {
                        /* Keep pm extension bit corresponding to peer device role */
                        uint8_t t_pm_ext = ((uint8_t)step_config_p->pm_ext >> (uint8_t)role) & 0x1U;
                        HADM_DECODE_HW_RTP_PCT(iq[ap], ipt_refl, curr_iq);
                        if (!ipt_refl)
                        {
                            /* Do not rotate PCTs as it has no effect on IPT HW implementation and it would corrupt Q=0 */
                            lcl_hadm_measurement_phase_rotation(&curr_iq, (uint8_t)step_config_p->channel, ant_id_seq[pm_ext_ap_ind]);
                        }
                        HADM_ENCODE_HCI_RTP_PCT(curr_iq, res_buff_p);
                        HADM_SET_RTP_TONE_QUALITY_WITH_EXT_SLOT(iq[ap], res_buff_p, t_pm_ext);
                    }
                    else
                    {
                        curr_iq = 0;
                        HADM_ENCODE_HCI_RTP_PCT(curr_iq, res_buff_p);
                        HADM_SET_RTP_TONE_QUALITY_WITH_EXT_SLOT(0x3U, res_buff_p, 0U);
                    }
                }
            }
            if (hadm_meas_p->config_p->role == HADM_ROLE_SNIFFER)
            {
                /* Switch output result buffer */
                if (nb_iter == 0U)
                {
                    res_buff1_p = res_buff_p;
                    res_buff_p = res_buff2_p;
                    nb_iter = 1;
                }
                else
                {
                    res_buff2_p = res_buff_p;
                    res_buff_p = res_buff1_p;
                    nb_iter = HADM_SNIFFER_DEVICE_NB;
                }
            }
            else
            {
                res_buff1_p = res_buff_p;
                nb_iter = HADM_SNIFFER_DEVICE_NB;
            }
        } while (nb_iter < HADM_SNIFFER_DEVICE_NB);
        
