nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    if (((hadm_meas_p->debug_flags & HADM_DBG_FLG_DBG_INFO) != 0U) &&
        (hadm_meas_p->pkt_ram.step_result.curr_step_idx == hadm_meas_p->config_p->stepsNb))
    {
        /* On KW47, just report hadm_info_t for debug. Done in the last reported event. */
        hadm_meas_p->result_p->debugBuffer = (uint8_t *)&hadm_meas_p->info;
        hadm_meas_p->result_p->debugBufferSize = (uint16_t)sizeof(hadm_info_t);
    }

    /* CLear IRQ status flags */
    LCL_HAL_RSM_SET_IRQ_STATUS_FLAGS(irq_status);
    
    /* Notify LL */
    DEBUG_PIN1_SET
    if (HADM_EVENT_INVALID != type)
    {
        BLE_HADM_NotifyLL(hadm_meas_p->config_p->connIdx, hadm_meas_p->result_p, type, hal_status);
    }
    DEBUG_PIN1_CLR

    if (type == HADM_EVENT_EOS)
    {
        lcl_hadm_measurement_cleanup(hadm_meas_p);
        hadm_device.active_meas_p = NULL;
    }

    DEBUG_PIN0_CLR
}

#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
void BRF_INT_IRQHandler(void)
{
    uint32_t irq_status = XCVR_MISC->XCVR_STATUS;

    if ((irq_status & XCVR_MISC_XCVR_STATUS_TSM_IRQ0_MASK) != 0U)
    {
        /* Write one to clear status bit */
        XCVR_MISC->XCVR_STATUS = XCVR_MISC_XCVR_STATUS_TSM_IRQ0_MASK;
        hadm_meas_t *hadm_meas_p = hadm_device.active_meas_p;
        hadm_proc_t *hadm_proc = &hadm_procs[hadm_meas_p->config_p->connIdx];
        bool_t compensate_cfo = (hadm_meas_p->config_p->role != HADM_ROLE_REFLECTOR) && (hadm_proc->ppm != 0) && ((hadm_meas_p->debug_flags & HADM_DBG_FLG_CFO_COMP_DIS) == 0U);

        if (compensate_cfo)
        {
            uint32_t rsm_curr_step = LCL_HAL_RSM_GET_CURRENT_STEP;
            /* Prepare CFO for next step */
            rsm_curr_step ++;
            if ((rsm_curr_step > hadm_meas_p->config_p->mode0Nb) && (rsm_curr_step < hadm_meas_p->config_p->stepsNb))
            {
                int32_t cfo;
                BLE_HADM_Chan_Mode_PmExt_AntPerm_t *step_config_p = &hadm_meas_p->config_p->chModePmAntMap[rsm_curr_step];
                /* Initiator or sniffer */
                cfo = LCL_HAL_COMPUTE_CHANNEL_CFO(step_config_p->channel, hadm_proc->ppm);
                (void)lcl_hadm_apply_cfo_per_step(cfo);
            }
        }
    }

}
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */

/* EOF */